In [1]:
#Numpy Arrays

import numpy as np

l1 = [1,2,3,4,5]
np.array(l1)

array([1, 2, 3, 4, 5])

In [2]:
np.arange(1,11)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [5]:
np.zeros(9)

array([0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [6]:
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [7]:
np.ones(100)

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [13]:
np.linspace(3, 9, 50)

array([3.        , 3.12244898, 3.24489796, 3.36734694, 3.48979592,
       3.6122449 , 3.73469388, 3.85714286, 3.97959184, 4.10204082,
       4.2244898 , 4.34693878, 4.46938776, 4.59183673, 4.71428571,
       4.83673469, 4.95918367, 5.08163265, 5.20408163, 5.32653061,
       5.44897959, 5.57142857, 5.69387755, 5.81632653, 5.93877551,
       6.06122449, 6.18367347, 6.30612245, 6.42857143, 6.55102041,
       6.67346939, 6.79591837, 6.91836735, 7.04081633, 7.16326531,
       7.28571429, 7.40816327, 7.53061224, 7.65306122, 7.7755102 ,
       7.89795918, 8.02040816, 8.14285714, 8.26530612, 8.3877551 ,
       8.51020408, 8.63265306, 8.75510204, 8.87755102, 9.        ])

In [19]:
np.eye(5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

In [21]:
np.random.rand(5)

array([0.9850611 , 0.64182498, 0.97366379, 0.99775821, 0.09978127])

In [22]:
np.random.rand(5,5)

array([[0.39831774, 0.04749997, 0.50995462, 0.36239157, 0.36939024],
       [0.18240046, 0.83490207, 0.00415382, 0.33182335, 0.00975338],
       [0.18634754, 0.32556945, 0.51040329, 0.90690862, 0.91899851],
       [0.74362901, 0.87314046, 0.17527694, 0.93585382, 0.34278049],
       [0.3171369 , 0.57796135, 0.75177168, 0.96066668, 0.98032946]])

In [24]:
# Gaussian distribution

np.random.randn(2)

array([0.30294672, 0.18989521])

In [28]:
np.random.randint(20, 50, 20)

array([47, 47, 28, 37, 32, 46, 38, 29, 49, 33, 20, 32, 47, 31, 41, 42, 35,
       20, 39, 36])

In [29]:
arr = np.arange(25)

In [30]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24])

In [34]:
arr.reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [37]:
random_array = np.random.randint(10, 100, 50)

In [38]:
random_array

array([64, 88, 19, 76, 15, 30, 71, 56, 18, 80, 22, 70, 26, 47, 85, 66, 31,
       64, 50, 16, 61, 87, 69, 57, 33, 95, 28, 59, 21, 85, 37, 35, 25, 25,
       99, 26, 48, 24, 19, 19, 71, 76, 69, 49, 45, 76, 42, 86, 32, 50])

In [41]:
random_array[20]

61

In [43]:
# it will return index location
index = random_array.argmax()
random_array[index]

99

In [44]:
type(random_array)

numpy.ndarray

In [46]:
random_array.dtype

dtype('int32')

In [48]:
# NUMPY indexing and selection

my_array = np.arange(1,11)
my_array

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [50]:
copy_array = my_array[0:6]
copy_array

array([1, 2, 3, 4, 5, 6])

In [55]:
copy_array[:]

array([1, 2, 3, 4, 5, 6])

In [56]:
copy_array[:] = 99

In [57]:
my_array

array([99, 99, 99, 99, 99, 99,  7,  8,  9, 10])

In [58]:
real_copy = my_array.copy()

In [59]:
real_copy

array([99, 99, 99, 99, 99, 99,  7,  8,  9, 10])

In [60]:
real_copy[:] = 88

In [61]:
real_copy

array([88, 88, 88, 88, 88, 88, 88, 88, 88, 88])

In [62]:
my_array

array([99, 99, 99, 99, 99, 99,  7,  8,  9, 10])

In [94]:
matrix = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])

In [95]:
matrix

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [106]:
matrix[2:,2:]

array([[11, 12]])

In [107]:
pretty_matrix = np.arange(50)

In [108]:
pretty_matrix

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49])

In [111]:
greatter_than_x_number = pretty_matrix > 45

In [113]:
pretty_matrix[greatter_than_x_number]

array([46, 47, 48, 49])

In [115]:
pretty_matrix[pretty_matrix > 48]

array([49])

In [142]:
#NumPy Operations
potato_array = np.arange(0,101)

In [127]:
potato_array + potato_array

array([  0,   2,   4,   6,   8,  10,  12,  14,  16,  18,  20,  22,  24,
        26,  28,  30,  32,  34,  36,  38,  40,  42,  44,  46,  48,  50,
        52,  54,  56,  58,  60,  62,  64,  66,  68,  70,  72,  74,  76,
        78,  80,  82,  84,  86,  88,  90,  92,  94,  96,  98, 100, 102,
       104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128,
       130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154,
       156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180,
       182, 184, 186, 188, 190, 192, 194, 196, 198, 200])

In [135]:
potato_array * potato_array

array([    0,     1,     4,     9,    16,    25,    36,    49,    64,
          81,   100,   121,   144,   169,   196,   225,   256,   289,
         324,   361,   400,   441,   484,   529,   576,   625,   676,
         729,   784,   841,   900,   961,  1024,  1089,  1156,  1225,
        1296,  1369,  1444,  1521,  1600,  1681,  1764,  1849,  1936,
        2025,  2116,  2209,  2304,  2401,  2500,  2601,  2704,  2809,
        2916,  3025,  3136,  3249,  3364,  3481,  3600,  3721,  3844,
        3969,  4096,  4225,  4356,  4489,  4624,  4761,  4900,  5041,
        5184,  5329,  5476,  5625,  5776,  5929,  6084,  6241,  6400,
        6561,  6724,  6889,  7056,  7225,  7396,  7569,  7744,  7921,
        8100,  8281,  8464,  8649,  8836,  9025,  9216,  9409,  9604,
        9801, 10000])

In [139]:
(potato_array + 2) - 2

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100])

In [140]:
potato_array / potato_array

C:\Users\Araceli\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [143]:
# You can see more universal functions in documentation
np.sqrt(potato_array)

array([ 0.        ,  1.        ,  1.41421356,  1.73205081,  2.        ,
        2.23606798,  2.44948974,  2.64575131,  2.82842712,  3.        ,
        3.16227766,  3.31662479,  3.46410162,  3.60555128,  3.74165739,
        3.87298335,  4.        ,  4.12310563,  4.24264069,  4.35889894,
        4.47213595,  4.58257569,  4.69041576,  4.79583152,  4.89897949,
        5.        ,  5.09901951,  5.19615242,  5.29150262,  5.38516481,
        5.47722558,  5.56776436,  5.65685425,  5.74456265,  5.83095189,
        5.91607978,  6.        ,  6.08276253,  6.164414  ,  6.244998  ,
        6.32455532,  6.40312424,  6.4807407 ,  6.55743852,  6.63324958,
        6.70820393,  6.78232998,  6.8556546 ,  6.92820323,  7.        ,
        7.07106781,  7.14142843,  7.21110255,  7.28010989,  7.34846923,
        7.41619849,  7.48331477,  7.54983444,  7.61577311,  7.68114575,
        7.74596669,  7.81024968,  7.87400787,  7.93725393,  8.        ,
        8.06225775,  8.1240384 ,  8.18535277,  8.24621125,  8.30662386,
        8.36660027,  8.42614977,  8.48528137,  8.54400375,  8.60232527,
        8.66025404,  8.71779789,  8.77496439,  8.83176087,  8.88819442,
        8.94427191,  9.        ,  9.05538514,  9.11043358,  9.16515139,
        9.21954446,  9.2736185 ,  9.32737905,  9.38083152,  9.43398113,
        9.48683298,  9.53939201,  9.59166305,  9.64365076,  9.69535971,
        9.74679434,  9.79795897,  9.8488578 ,  9.89949494,  9.94987437,
       10.        ])

In [1]:
# Pandas
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]

array = np.array(my_data)

d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data  = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(array, labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
# DataFrames
from numpy.random import randn

In [9]:
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
type(df['W'])

pandas.core.series.Series

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [22]:
df['New'] = df['W'] + df['Y']

In [23]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [31]:
df.drop('New', axis = 1, inplace = True)

KeyError: "['New'] not found in axis"

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df.shape

(5, 4)

In [39]:
# ROWS

df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [43]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df.loc['C', 'Y']

0.5288134940893595

In [46]:
df.loc[['A', 'B'], ['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [49]:
df > 1

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [50]:
greater_than_zero = df > 0

In [51]:
greater_than_zero

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [52]:
df[greater_than_zero]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [56]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
result = df[df['W'] > 0]

In [62]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [65]:
result['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [69]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [71]:
df[df['W'] > 0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [72]:
w_greater_than_zero = df['W'] > 0

In [73]:
dataFrame_excluding_w_condition = df[w_greater_than_zero]

In [80]:
dataFrame_excluding_w_condition

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [83]:
y_z_columns = ['Y', 'Z']

In [84]:
dataFrame_excluding_w_condition[y_z_columns]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [85]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
df[df['Y'] > 1]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [91]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [94]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [95]:
new_indexes = 'CA NY WY OR CO'.split()

In [103]:
new_indexes

['CA', 'NY', 'WY', 'OR']

In [105]:
#df['States'] = new_indexes

In [106]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [112]:
df.set_index('States', inplace = True)

In [113]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [114]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [115]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [116]:
inside

[1, 2, 3, 1, 2, 3]

In [117]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [118]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [120]:
randn(6,2)

array([[ 0.16690464,  0.18450186],
       [ 0.80770591,  0.07295968],
       [ 0.63878701,  0.3296463 ],
       [-0.49710402, -0.7540697 ],
       [-0.9434064 ,  0.48475165],
       [-0.11677332,  1.9017548 ]])

In [123]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [124]:
df

             A         B
G1 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366
G2 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259

In [126]:
df.loc['G1'].loc[3]

A   -1.136645
B    0.000366
Name: 3, dtype: float64

In [130]:
df.index.names = ['Groups', 'Index']

In [131]:
df

                     A         B
Groups Index
G1     1      0.238127  1.996652
       2     -0.993263  0.196800
       3     -1.136645  0.000366
G2     1      1.025984 -0.156598
       2     -0.031579  0.649826
       3      2.154846 -0.610259

In [134]:
df.xs(1,level='Index')

               A         B
Groups
G1      0.238127  1.996652
G2      1.025984 -0.156598

In [135]:
df.xs('G1')

              A         B
Index
1      0.238127  1.996652
2     -0.993263  0.196800
3     -1.136645  0.000366

In [136]:
# MISSING VALUES

d = {'A': [1,2, np.nan], 'B': [5, np.nan, np.nan], 'C':[1,2,3]}
df = pd.DataFrame(d)

In [137]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [139]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [153]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [154]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [155]:
df.fillna(value= 'NEW VALUE')

           A          B  C
0          1          5  1
1          2  NEW VALUE  2
2  NEW VALUE  NEW VALUE  3

In [156]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [157]:
# GROUP BY
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [158]:
df = pd.DataFrame(data)

In [159]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [166]:
group_by_company = df.groupby('Company').sum().loc['GOOG']

In [168]:
group_by_company

Sales    320
Name: GOOG, dtype: int64

In [170]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [179]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [18]:
#Operations
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
df['col2'].nunique()

3

In [5]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
def times2(x):
    return x*2

In [7]:
df['col2'].sum()

2109

In [8]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [11]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [12]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [13]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [16]:
#del df['col1']

In [19]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [21]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [25]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [26]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [29]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [32]:
#Data Input and Output
# For xml and sql use following libraries are required

In [33]:
import pandas as pd

In [34]:
pwd

'C:\\Users\\Araceli\\Documents\\Python Scripts\\Py-DS-ML-Bootcamp-master\\Refactored_Py_DS_ML_Bootcamp-master\\Practice'

In [38]:
pd.read_csv('../03-Python-for-Data-Analysis-Pandas/example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [66]:
df = pd.read_csv('../03-Python-for-Data-Analysis-Pandas/example')

In [67]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [68]:
df.to_csv('my_output', index=False)

In [69]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [70]:
pd.read_excel('../03-Python-for-Data-Analysis-Pandas/Excel_Sample.xlsx', sheet_name='Sheet1', index=False)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [71]:
df.to_excel('Example2.xlsx', sheet_name='NewSheet')

In [72]:
web_data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [73]:
type(web_data)

list

In [74]:
web_data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
...,...,...,...,...,...,...
555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [75]:
web_data

[                             Bank Name        City  ST   CERT  \
 0                   Ericson State Bank     Ericson  NE  18265
 1     City National Bank of New Jersey      Newark  NJ  21111
 2                        Resolute Bank      Maumee  OH  58317
 3                Louisa Community Bank      Louisa  KY  58112
 4                 The Enloe State Bank      Cooper  TX  10716
 ..                                 ...         ...  ..    ...
 555                 Superior Bank, FSB    Hinsdale  IL  32646
 556                Malta National Bank       Malta  OH   6629
 557    First Alliance Bank & Trust Co.  Manchester  NH  34264
 558  National State Bank of Metropolis  Metropolis  IL   3815
 559                   Bank of Honolulu    Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0             Farmers and Merchants Bank  February 14, 2020
 1                        Industrial Bank   November 1, 2019
 2                     Buckeye State Bank   October 25, 2019
 3      Kentucky Farmers Bank Corporation   October 25, 2019
 4                     Legend Bank, N. A.       May 31, 2019
 ..                                   ...                ...
 555                Superior Federal, FSB      July 27, 2001
 556                    North Valley Bank        May 3, 2001
 557  Southern New Hampshire Bank & Trust   February 2, 2001
 558              Banterra Bank of Marion  December 14, 2000
 559                   Bank of the Orient   October 13, 2000

 [560 rows x 6 columns]]

In [76]:
web_data[0].head(10
          )

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
5,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
6,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017"
7,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017"
8,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017"
9,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017"

In [63]:
from sqlalchemy import create_engine

In [64]:
engine = create_engine('sqlite:///:memory:')

In [65]:
engine

Engine(sqlite:///:memory:)

In [78]:
df.to_sql('MyTable', engine)

In [79]:
sqlDataFrame = pd.read_sql('MyTable', con=engine)

In [80]:
sqlDataFrame

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15